Revit 2027 API
FamilySymbol.SetStructuralSection Method
 Sets the structural section in element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetStructuralSection(
	StructuralSection structuralSection
)
Public Sub SetStructuralSection (
	structuralSection As StructuralSection
)
public:
void SetStructuralSection(
	StructuralSection^ structuralSection
)
member SetStructuralSection :
        structuralSection : StructuralSection -> unit
Parameters
structuralSection StructuralSection
 Structural section with values that will be set.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This FamilySymbol cannot have a structural section.
Remarks
 Only beams, braces and structural columns can have a structural section. To check if the element can have structural section use the CanHaveStructuralSection() method.
See Also
Reference
FamilySymbol Class
Autodesk.Revit.DB Namespace